; domain
(define (domain AUV)
(:requirements :typing :equality)
(:types vehicle location resource - object
        auv ship - vehicle
)

(:predicates (at ?v - vehicle ?l - location)
             (connected ?l1 ?l2 - location)
             (at-res ?r - resource ?l - location)
             (sampled ?r - resource)
             (free ?l - location)
             (operational ?a - auv)
             (connected-ship ?s - ship ?l1 ?l2 - location)
             (outside ?s - ship)
             (entry ?s - ship ?l - location)
             (exit ?s - ship ?l - location)
             
             (act-round)
             (dup-free ?l - location)
)

(:action move
:parameters (?a - auv ?l1 ?l2 - location)
:precondition (and (at ?a ?l1)
                   (operational ?a)
                   (connected ?l1 ?l2)
                   (free ?l2)
              )
:effect (and (not (at ?a ?l1))
             (at ?a ?l2)
             (free ?l1)
             (not (free ?l2))
        )
)

(:action sample
:parameters (?a - auv ?r - resource ?l - location)
:precondition (and (at ?a ?l)
                   (at-res ?r ?l)
                   (operational ?a)
              )
:effect (and (sampled ?r)
        )
)



)

; problem
(define (problem AUV-problem)
(:domain AUV)
(:objects a - auv
          s s2 - ship
          r1 r2 r3 - resource
          l-1-1 l-1-2 l-1-3 l-1-4 l-1-5 l-1-6 l-1-7 l-1-8 l-2-1 l-2-2 l-2-3 l-2-4 l-2-5 l-2-6 l-2-7 l-2-8 l-3-1 l-3-2 l-3-3 l-3-4 l-3-5 l-3-6 l-3-7 l-3-8 l-4-1 l-4-2 l-4-3 l-4-4 l-4-5 l-4-6 l-4-7 l-4-8 l-5-1 l-5-2 l-5-3 l-5-4 l-5-5 l-5-6 l-5-7 l-5-8 l-6-1 l-6-2 l-6-3 l-6-4 l-6-5 l-6-6 l-6-7 l-6-8 l-7-1 l-7-2 l-7-3 l-7-4 l-7-5 l-7-6 l-7-7 l-7-8 l-8-1 l-8-2 l-8-3 l-8-4 l-8-5 l-8-6 l-8-7 l-8-8 - location
)

(:init (act-round)
       (operational a)
       (outside s)
       (outside s2)
       (at a l-1-1)
       (at-res r1 l-2-7)
       (at-res r2 l-7-6)
       (at-res r3 l-8-2)

(free l-1-2)
(free l-1-3)
(free l-1-4)
(free l-1-5)
(free l-1-6)
(free l-1-7)
(free l-1-8)
(free l-2-1)
(free l-2-2)
(free l-2-3)
(free l-2-4)
(free l-2-5)
(free l-2-6)
(free l-2-7)
(free l-2-8)
(free l-3-1)
(free l-3-2)
(free l-3-3)
(free l-3-4)
(free l-3-5)
(free l-3-6)
(free l-3-7)
(free l-3-8)
(free l-4-1)
(free l-4-2)
(free l-4-3)
(free l-4-4)
(free l-4-5)
(free l-4-6)
(free l-4-7)
(free l-4-8)
(free l-5-1)
(free l-5-2)
(free l-5-3)
(free l-5-4)
(free l-5-5)
(free l-5-6)
(free l-5-7)
(free l-5-8)
(free l-6-1)
(free l-6-2)
(free l-6-3)
(free l-6-4)
(free l-6-5)
(free l-6-6)
(free l-6-7)
(free l-6-8)
(free l-7-1)
(free l-7-2)
(free l-7-3)
(free l-7-4)
(free l-7-5)
(free l-7-6)
(free l-7-7)
(free l-7-8)
(free l-8-1)
(free l-8-2)
(free l-8-3)
(free l-8-4)
(free l-8-5)
(free l-8-6)
(free l-8-7)
(free l-8-8)

(dup-free l-1-2)
(dup-free l-1-3)
(dup-free l-1-4)
(dup-free l-1-5)
(dup-free l-1-6)
(dup-free l-1-7)
(dup-free l-1-8)
(dup-free l-2-1)
(dup-free l-2-2)
(dup-free l-2-3)
(dup-free l-2-4)
(dup-free l-2-5)
(dup-free l-2-6)
(dup-free l-2-7)
(dup-free l-2-8)
(dup-free l-3-1)
(dup-free l-3-2)
(dup-free l-3-3)
(dup-free l-3-4)
(dup-free l-3-5)
(dup-free l-3-6)
(dup-free l-3-7)
(dup-free l-3-8)
(dup-free l-4-1)
(dup-free l-4-2)
(dup-free l-4-3)
(dup-free l-4-4)
(dup-free l-4-5)
(dup-free l-4-6)
(dup-free l-4-7)
(dup-free l-4-8)
(dup-free l-5-1)
(dup-free l-5-2)
(dup-free l-5-3)
(dup-free l-5-4)
(dup-free l-5-5)
(dup-free l-5-6)
(dup-free l-5-7)
(dup-free l-5-8)
(dup-free l-6-1)
(dup-free l-6-2)
(dup-free l-6-3)
(dup-free l-6-4)
(dup-free l-6-5)
(dup-free l-6-6)
(dup-free l-6-7)
(dup-free l-6-8)
(dup-free l-7-1)
(dup-free l-7-2)
(dup-free l-7-3)
(dup-free l-7-4)
(dup-free l-7-5)
(dup-free l-7-6)
(dup-free l-7-7)
(dup-free l-7-8)
(dup-free l-8-1)
(dup-free l-8-2)
(dup-free l-8-3)
(dup-free l-8-4)
(dup-free l-8-5)
(dup-free l-8-6)
(dup-free l-8-7)
(dup-free l-8-8)


(connected l-1-1 l-2-1)
(connected l-2-1 l-1-1)
(connected l-1-1 l-1-2)
(connected l-1-2 l-1-1)
(connected l-1-2 l-2-2)
(connected l-2-2 l-1-2)
(connected l-1-2 l-1-3)
(connected l-1-3 l-1-2)
(connected l-1-3 l-2-3)
(connected l-2-3 l-1-3)
(connected l-1-3 l-1-4)
(connected l-1-4 l-1-3)
(connected l-1-4 l-2-4)
(connected l-2-4 l-1-4)
(connected l-1-4 l-1-5)
(connected l-1-5 l-1-4)
(connected l-1-5 l-2-5)
(connected l-2-5 l-1-5)
(connected l-1-5 l-1-6)
(connected l-1-6 l-1-5)
(connected l-1-6 l-2-6)
(connected l-2-6 l-1-6)
(connected l-1-6 l-1-7)
(connected l-1-7 l-1-6)
(connected l-1-7 l-2-7)
(connected l-2-7 l-1-7)
(connected l-1-7 l-1-8)
(connected l-1-8 l-1-7)
(connected l-2-1 l-3-1)
(connected l-3-1 l-2-1)
(connected l-2-1 l-2-2)
(connected l-2-2 l-2-1)
(connected l-2-2 l-3-2)
(connected l-3-2 l-2-2)
(connected l-2-2 l-2-3)
(connected l-2-3 l-2-2)
(connected l-2-3 l-3-3)
(connected l-3-3 l-2-3)
(connected l-2-3 l-2-4)
(connected l-2-4 l-2-3)
(connected l-2-4 l-3-4)
(connected l-3-4 l-2-4)
(connected l-2-4 l-2-5)
(connected l-2-5 l-2-4)
(connected l-2-5 l-3-5)
(connected l-3-5 l-2-5)
(connected l-2-5 l-2-6)
(connected l-2-6 l-2-5)
(connected l-2-6 l-3-6)
(connected l-3-6 l-2-6)
(connected l-2-6 l-2-7)
(connected l-2-7 l-2-6)
(connected l-2-7 l-3-7)
(connected l-3-7 l-2-7)
(connected l-2-7 l-2-8)
(connected l-2-8 l-2-7)
(connected l-3-1 l-4-1)
(connected l-4-1 l-3-1)
(connected l-3-1 l-3-2)
(connected l-3-2 l-3-1)
(connected l-3-2 l-4-2)
(connected l-4-2 l-3-2)
(connected l-3-2 l-3-3)
(connected l-3-3 l-3-2)
(connected l-3-3 l-4-3)
(connected l-4-3 l-3-3)
(connected l-3-3 l-3-4)
(connected l-3-4 l-3-3)
(connected l-3-4 l-4-4)
(connected l-4-4 l-3-4)
(connected l-3-4 l-3-5)
(connected l-3-5 l-3-4)
(connected l-3-5 l-4-5)
(connected l-4-5 l-3-5)
(connected l-3-5 l-3-6)
(connected l-3-6 l-3-5)
(connected l-3-6 l-4-6)
(connected l-4-6 l-3-6)
(connected l-3-6 l-3-7)
(connected l-3-7 l-3-6)
(connected l-3-7 l-4-7)
(connected l-4-7 l-3-7)
(connected l-3-7 l-3-8)
(connected l-3-8 l-3-7)
(connected l-4-1 l-5-1)
(connected l-5-1 l-4-1)
(connected l-4-1 l-4-2)
(connected l-4-2 l-4-1)
(connected l-4-2 l-5-2)
(connected l-5-2 l-4-2)
(connected l-4-2 l-4-3)
(connected l-4-3 l-4-2)
(connected l-4-3 l-5-3)
(connected l-5-3 l-4-3)
(connected l-4-3 l-4-4)
(connected l-4-4 l-4-3)
(connected l-4-4 l-5-4)
(connected l-5-4 l-4-4)
(connected l-4-4 l-4-5)
(connected l-4-5 l-4-4)
(connected l-4-5 l-5-5)
(connected l-5-5 l-4-5)
(connected l-4-5 l-4-6)
(connected l-4-6 l-4-5)
(connected l-4-6 l-5-6)
(connected l-5-6 l-4-6)
(connected l-4-6 l-4-7)
(connected l-4-7 l-4-6)
(connected l-4-7 l-5-7)
(connected l-5-7 l-4-7)
(connected l-4-7 l-4-8)
(connected l-4-8 l-4-7)
(connected l-5-1 l-6-1)
(connected l-6-1 l-5-1)
(connected l-5-1 l-5-2)
(connected l-5-2 l-5-1)
(connected l-5-2 l-6-2)
(connected l-6-2 l-5-2)
(connected l-5-2 l-5-3)
(connected l-5-3 l-5-2)
(connected l-5-3 l-6-3)
(connected l-6-3 l-5-3)
(connected l-5-3 l-5-4)
(connected l-5-4 l-5-3)
(connected l-5-4 l-6-4)
(connected l-6-4 l-5-4)
(connected l-5-4 l-5-5)
(connected l-5-5 l-5-4)
(connected l-5-5 l-6-5)
(connected l-6-5 l-5-5)
(connected l-5-5 l-5-6)
(connected l-5-6 l-5-5)
(connected l-5-6 l-6-6)
(connected l-6-6 l-5-6)
(connected l-5-6 l-5-7)
(connected l-5-7 l-5-6)
(connected l-5-7 l-6-7)
(connected l-6-7 l-5-7)
(connected l-5-7 l-5-8)
(connected l-5-8 l-5-7)
(connected l-6-1 l-7-1)
(connected l-7-1 l-6-1)
(connected l-6-1 l-6-2)
(connected l-6-2 l-6-1)
(connected l-6-2 l-7-2)
(connected l-7-2 l-6-2)
(connected l-6-2 l-6-3)
(connected l-6-3 l-6-2)
(connected l-6-3 l-7-3)
(connected l-7-3 l-6-3)
(connected l-6-3 l-6-4)
(connected l-6-4 l-6-3)
(connected l-6-4 l-7-4)
(connected l-7-4 l-6-4)
(connected l-6-4 l-6-5)
(connected l-6-5 l-6-4)
(connected l-6-5 l-7-5)
(connected l-7-5 l-6-5)
(connected l-6-5 l-6-6)
(connected l-6-6 l-6-5)
(connected l-6-6 l-7-6)
(connected l-7-6 l-6-6)
(connected l-6-6 l-6-7)
(connected l-6-7 l-6-6)
(connected l-6-7 l-7-7)
(connected l-7-7 l-6-7)
(connected l-6-7 l-6-8)
(connected l-6-8 l-6-7)
(connected l-7-1 l-8-1)
(connected l-8-1 l-7-1)
(connected l-7-1 l-7-2)
(connected l-7-2 l-7-1)
(connected l-7-2 l-8-2)
(connected l-8-2 l-7-2)
(connected l-7-2 l-7-3)
(connected l-7-3 l-7-2)
(connected l-7-3 l-8-3)
(connected l-8-3 l-7-3)
(connected l-7-3 l-7-4)
(connected l-7-4 l-7-3)
(connected l-7-4 l-8-4)
(connected l-8-4 l-7-4)
(connected l-7-4 l-7-5)
(connected l-7-5 l-7-4)
(connected l-7-5 l-8-5)
(connected l-8-5 l-7-5)
(connected l-7-5 l-7-6)
(connected l-7-6 l-7-5)
(connected l-7-6 l-8-6)
(connected l-8-6 l-7-6)
(connected l-7-6 l-7-7)
(connected l-7-7 l-7-6)
(connected l-7-7 l-8-7)
(connected l-8-7 l-7-7)
(connected l-7-7 l-7-8)
(connected l-7-8 l-7-7)
(connected l-8-7 l-8-8)
(connected l-8-8 l-8-7)
(connected l-7-8 l-8-8)
(connected l-8-8 l-7-8)

(entry s l-5-8)
(exit s l-5-1)
;(exit s l-8-5)
(connected-ship s l-5-8 l-5-7)
(connected-ship s l-5-7 l-5-6)
(connected-ship s l-5-6 l-5-5)
(connected-ship s l-5-5 l-5-4)
(connected-ship s l-5-4 l-5-3)
(connected-ship s l-5-3 l-5-2)
(connected-ship s l-5-2 l-5-1)

;(connected-ship s l-5-5 l-6-5)
;(connected-ship s l-6-5 l-7-5)
;(connected-ship s l-7-5 l-8-5)

(entry s2 l-1-5)
(exit s2 l-8-5)

(connected-ship s2 l-1-5 l-2-5)
(connected-ship s2 l-2-5 l-3-5)
(connected-ship s2 l-3-5 l-4-5)
(connected-ship s2 l-4-5 l-5-5)
(connected-ship s2 l-5-5 l-6-5)
(connected-ship s2 l-6-5 l-7-5)
(connected-ship s2 l-7-5 l-8-5)


)

(:goal (and (sampled r1)
            (sampled r2)
            (sampled r3)
            (at a l-1-1)
            (operational a)
       )
)

)

; plan
1. (move a l-1-1 l-1-2)
   deleted: (at a l-1-1) (free l-1-2)
   added: (at a l-1-2) (free l-1-1)
   goals met: 1 of 5
2. (move a l-1-2 l-1-3)
   deleted: (at a l-1-2) (free l-1-3)
   added: (at a l-1-3) (free l-1-2)
   goals met: 1 of 5
3. (move a l-1-3 l-1-4)
   deleted: (at a l-1-3) (free l-1-4)
   added: (at a l-1-4) (free l-1-3)
   goals met: 1 of 5
4. (move a l-1-4 l-2-4)
   deleted: (at a l-1-4) (free l-2-4)
   added: (at a l-2-4) (free l-1-4)
   goals met: 1 of 5
5. (move a l-2-4 l-2-5)
   deleted: (at a l-2-4) (free l-2-5)
   added: (at a l-2-5) (free l-2-4)
   goals met: 1 of 5
6. (move a l-2-5 l-2-6)
   deleted: (at a l-2-5) (free l-2-6)
   added: (at a l-2-6) (free l-2-5)
   goals met: 1 of 5
7. (move a l-2-6 l-2-7)
   deleted: (at a l-2-6) (free l-2-7)
   added: (at a l-2-7) (free l-2-6)
   goals met: 1 of 5
8. (sample a r1 l-2-7)
   added: (sampled r1)
   goals met: 2 of 5
9. (move a l-2-7 l-2-6)
   deleted: (at a l-2-7) (free l-2-6)
   added: (at a l-2-6) (free l-2-7)
   goals met: 2 of 5
10. (move a l-2-6 l-2-5)
   deleted: (at a l-2-6) (free l-2-5)
   added: (at a l-2-5) (free l-2-6)
   goals met: 2 of 5
11. (move a l-2-5 l-2-4)
   deleted: (at a l-2-5) (free l-2-4)
   added: (at a l-2-4) (free l-2-5)
   goals met: 2 of 5
12. (move a l-2-4 l-2-3)
   deleted: (at a l-2-4) (free l-2-3)
   added: (at a l-2-3) (free l-2-4)
   goals met: 2 of 5
13. (move a l-2-3 l-2-2)
   deleted: (at a l-2-3) (free l-2-2)
   added: (at a l-2-2) (free l-2-3)
   goals met: 2 of 5
14. (move a l-2-2 l-3-2)
   deleted: (at a l-2-2) (free l-3-2)
   added: (at a l-3-2) (free l-2-2)
   goals met: 2 of 5
15. (move a l-3-2 l-4-2)
   deleted: (at a l-3-2) (free l-4-2)
   added: (at a l-4-2) (free l-3-2)
   goals met: 2 of 5
16. (move a l-4-2 l-5-2)
   deleted: (at a l-4-2) (free l-5-2)
   added: (at a l-5-2) (free l-4-2)
   goals met: 2 of 5
17. (move a l-5-2 l-6-2)
   deleted: (at a l-5-2) (free l-6-2)
   added: (at a l-6-2) (free l-5-2)
   goals met: 2 of 5
18. (move a l-6-2 l-7-2)
   deleted: (at a l-6-2) (free l-7-2)
   added: (at a l-7-2) (free l-6-2)
   goals met: 2 of 5
19. (move a l-7-2 l-8-2)
   deleted: (at a l-7-2) (free l-8-2)
   added: (at a l-8-2) (free l-7-2)
   goals met: 2 of 5
20. (sample a r3 l-8-2)
   added: (sampled r3)
   goals met: 3 of 5
21. (move a l-8-2 l-7-2)
   deleted: (at a l-8-2) (free l-7-2)
   added: (at a l-7-2) (free l-8-2)
   goals met: 3 of 5
22. (move a l-7-2 l-7-3)
   deleted: (at a l-7-2) (free l-7-3)
   added: (at a l-7-3) (free l-7-2)
   goals met: 3 of 5
23. (move a l-7-3 l-7-4)
   deleted: (at a l-7-3) (free l-7-4)
   added: (at a l-7-4) (free l-7-3)
   goals met: 3 of 5
24. (move a l-7-4 l-7-5)
   deleted: (at a l-7-4) (free l-7-5)
   added: (at a l-7-5) (free l-7-4)
   goals met: 3 of 5
25. (move a l-7-5 l-7-6)
   deleted: (at a l-7-5) (free l-7-6)
   added: (at a l-7-6) (free l-7-5)
   goals met: 3 of 5
26. (sample a r2 l-7-6)
   added: (sampled r2)
   goals met: 4 of 5
27. (move a l-7-6 l-6-6)
   deleted: (at a l-7-6) (free l-6-6)
   added: (at a l-6-6) (free l-7-6)
   goals met: 4 of 5
28. (move a l-6-6 l-5-6)
   deleted: (at a l-6-6) (free l-5-6)
   added: (at a l-5-6) (free l-6-6)
   goals met: 4 of 5
29. (move a l-5-6 l-5-5)
   deleted: (at a l-5-6) (free l-5-5)
   added: (at a l-5-5) (free l-5-6)
   goals met: 4 of 5
30. (move a l-5-5 l-4-5)
   deleted: (at a l-5-5) (free l-4-5)
   added: (at a l-4-5) (free l-5-5)
   goals met: 4 of 5
31. (move a l-4-5 l-4-4)
   deleted: (at a l-4-5) (free l-4-4)
   added: (at a l-4-4) (free l-4-5)
   goals met: 4 of 5
32. (move a l-4-4 l-3-4)
   deleted: (at a l-4-4) (free l-3-4)
   added: (at a l-3-4) (free l-4-4)
   goals met: 4 of 5
33. (move a l-3-4 l-3-3)
   deleted: (at a l-3-4) (free l-3-3)
   added: (at a l-3-3) (free l-3-4)
   goals met: 4 of 5
34. (move a l-3-3 l-2-3)
   deleted: (at a l-3-3) (free l-2-3)
   added: (at a l-2-3) (free l-3-3)
   goals met: 4 of 5
35. (move a l-2-3 l-2-2)
   deleted: (at a l-2-3) (free l-2-2)
   added: (at a l-2-2) (free l-2-3)
   goals met: 4 of 5
36. (move a l-2-2 l-1-2)
   deleted: (at a l-2-2) (free l-1-2)
   added: (at a l-1-2) (free l-2-2)
   goals met: 4 of 5
37. (move a l-1-2 l-1-1)
   deleted: (at a l-1-2) (free l-1-1)
   added: (at a l-1-1) (free l-1-2)
   goals met: 5 of 5
